{ "Patient Information": { "Gender and Age": "67-year-old man", "Patient History": "Diagnosed with arthritis 16 years ago, difficulty walking due to bilateral knee involvement, back pain, uses special shampoos for dandruff.", "Chief Complaint": "Right knee swelling and pain", "Secondary Symptoms": "Back pain", "Past_Medical_History": "Arthritis diagnosed 16 years ago", "Social_History": "Not provided", "Review_of_Systems": "Difficulty walking, frustration, improvement of pain with rest" }, "Physical_Examination_Findings": { "Main_Signs": {}, "System Examination": "Physical examination is notable for pitting of his nails." }, "Test_Results": "", "Correct_Diagnosis": "Psoriatic arthritis" } 
{ "Patient Information": { "Gender and Age": "27-year-old woman", "Patient History": "Concerns about physical appearance since adolescence, targeted by classmates and coworkers, struggles with acne and unwanted facial hair, multiple unsuccessful attempts at diet and exercise, family history of type 2 diabetes mellitus, irregular menstrual cycle (every 45 days), recent glucose tolerance test showing plasma glucose level of 160 mg/dL after 2 hours of a 75 g dose of oral glucose.", "Chief Complaint": "Concerns about physical appearance, particularly acne and unwanted facial hair", "Secondary Symptoms": "None listed", "Past_Medical_History": "Family history of type 2 diabetes mellitus", "Social_History": "Visits to a local spa for facial hair, struggles with physical appearance", "Review_of_Systems": "No additional symptoms provided" }, "Physical_Examination_Findings": { "Main_Signs": { "Pulse": "72/min", "Blood Pressure": "138/80 mm Hg", "Height": "160 cm (5 ft 3 in)", "Weight": "85 kg (187 lb)" }, "System Examination": "Physical examination is notable for severe inflammatory acne over the cheeks and forehead and dark coarse hairs on the back."  }, "Test_Results": "Glucose tolerance test: plasma glucose level of 160 mg/dL (8.9 mmol/L) after 2 hours of a 75 g dose of oral glucose.", "Correct_Diagnosis": "Polycystic ovarian syndrome (PCOS)" }
{ "Patient Information": { "Gender and Age": "55-year-old man", "Patient History": "The patient has a 6-week history of tingling pain in the sole of his right foot when raised above chest level during exercises, started exercising 2 months ago, right calf cramps when using the incline feature on the treadmill which forces frequent breaks, pain disappears after a few minutes of rest, 8-year history of type 2 diabetes mellitus, smokes two packs of cigarettes daily for 34 years, only medication is metformin.", "Chief Complaint": "Tingling pain in the sole of the right foot when raised above chest level during exercises and right calf cramping on treadmill incline", "Secondary Symptoms": "Pain disappears after resting for a few minutes", "Past_Medical_History": "8-year history of type 2 diabetes mellitus", "Social_History": "Smokes two packs of cigarettes daily for 34 years", "Review_of_Systems": "No back pain, normal muscle strength." }, "Physical_Examination_Findings": { "Main_Signs": { "Pulse": "82/min", "Blood_Pressure": "170/92 mm Hg" }, "System Examination": "Straight leg raise test elicits pallor and tingling pain in the right foot. Femoral pulses are palpable; right pedal pulses are absent." }, "Test_Results": "Physical examination notable for absence of right pedal pulses.", "Correct_Diagnosis": "Femoropopliteal artery stenosis" } 
